app/Http/Controllers/PostcardController.php

select count(*) as aggregate from "postcards" where "is_draft" = 0 and "online_at" >= '2023-06-10 00:00:00'
---
    public function index()
    {
        $isDraft = 0;
        return view('postcards.index', [
            'postcards' => Postcard::where('is_draft', '=', $isDraft)
                    ->where((Carbon::parse(date('Y-m-d H:s:i', strtotime('online_at')))
                    ->diffInSeconds(Carbon::parse(date('Y-m-d H:s:i', strtotime('offline_at'))), false)), '>=', '0')
                    ->paginate(10)
        ]);